{"config": [{"config": {"b_constraint": null, "nb_filter": 32, "input_dtype": "float32", "activation": "linear", "W_constraint": null, "bias": true, "init": "glorot_uniform", "nb_row": 3, "subsample": [1, 1], "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_1", "b_regularizer": null, "nb_col": 3, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "nb_filter": 32, "activation": "linear", "trainable": true, "bias": true, "init": "glorot_uniform", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "nb_col": 3, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_filter": 64, "activation": "linear", "trainable": true, "bias": true, "init": "glorot_uniform", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "nb_col": 3, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "nb_filter": 64, "activation": "linear", "trainable": true, "bias": true, "init": "glorot_uniform", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_4", "b_regularizer": null, "nb_col": 3, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_constraint": null, "bias": true, "output_dim": 512, "b_constraint": null, "input_dim": 4096, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "name": "dense_1", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_constraint": null, "bias": true, "output_dim": 10, "b_constraint": null, "input_dim": 512, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "name": "dense_2", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_6", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.2"}